example = 'Ласка'
# Вывеcти на экран(в консоль) первый символ строки
print(example[0])
# Вывеcти на экран(в консоль) последний символ строки
print(example[-1])
# Вывеcти на экран(в консоль) вторую половину строки
sym_example = len(example)
half_example = sym_example // 2
print(example[half_example:])
# Вывеcти на экран(в консоль) слово наоборот
print(example[::-1])
# Вывести на экран(в консоль) каждый второй символ строки
print(example[1::2])